def fun(a, b=10):   # b是在函数的定义处，所以b是形参，而且进行了赋值，所以b称为默认值形参
    print("a=", a)
    print("b=", b)


fun(a=100)

print("------------------------------------------")


def fun1(a, b, c):  # a,b,c在函数调用时的参数传递，成为形参
    print("a=", a)
    print("b=", b)
    print("c=", c)


fun1(10, 20, 30)
lst = [11, 22, 33]
print("----------------------------------_-------")
print(*lst)  # 加星号在函数调用时，将列表中的每个元素都转化为我们的位置实参传入
fun1(a=100, c=300, b=200)  # 函数的调用，所以是关键字实参


def fun2(a, b, *, c, d):  # 在bc之间加*表示，新号后面的形参只能通过关键字实参来进行赋值
    print("a=", a)
    print("b=", b)
    print("c=", c)
    print("d=", d)


"""需求，c，d只能采用关键字实参传递"""
fun2(10, 20, c=50, d=60)
