"""
切片操作:
    切片的结果-------->原列表片段的拷贝
    切片的范围-------->[start,stop)
                                    步长为正------>start不写默认为0,stop默认为列表最后一个
                                    步长为负------>start不写默认为列表最后一个,stop默认为0
    step:
        step默认为1------>简写为[start:stop]    [start:stop:]
        step为正数------->从start开始往后计算切片
        step为负数------->从start开始往前计算切片
"""

"""创建一个列表"""
lst = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
# 打印输出的片段是一个新列表
lst2 = lst[2:8:1]
print("原列表", id(lst))
print("切片片段", id(lst2))
# 步长为1的写法
print(lst[0:10])
print(lst[0:10:])
"""
步长为n的写法
print(lst[0:10:n])
"""
print("--------步长为正数时-------")
print("start默认为0", lst[:10:1])
print("stop默认为列表最后一个元素", lst[0::1])

print("————————————步长为负数时——————————")
print("start默认为列表最后一个元素,stop默认为0", lst[::-1])
